Autodesk.Revit.DB.IFCCategoryTemplate.GetMappingInfoById(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.CustomSubCategoryId)
Gets a copy of IFC mapping info by category id.
document:
A Revit document.
categoryId:
The category id.
customSubCategoryId:
The custom subcategory id.
Returns:
Return the info for this category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2025

Autodesk.Revit.DB.IFCCategoryTemplate.ListNames(Autodesk.Revit.DB.Document)
Returns a list of names of IFC export mapping templates.
document:
A Revit document to retrieve names from.
Returns:
An array of strings representing names of predefined setups.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.IFCCategoryTemplate.CopyTemplate(Autodesk.Revit.DB.Document,System.String)
Create copy of mapping template with new name.
Remarks:
The copied template is saved in the document passed as parameter.
Passing the same document as the source tampalte's document will create a new template in the same document.
The active template of the document remains unchanged.
document:
A Revit document to save the copied template.
copyTemplateName:
A name for copied template name.
Returns:
The copied mapping template element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The name already exists.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to create IFCCategoryTemplate element.
Since:
2025

Autodesk.Revit.DB.IFCCategoryTemplate.SetActiveTemplate
Sets the mapping template element to be the active mapping template for its document.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Invalid use of in-session template.
Since:
2026

Autodesk.Revit.DB.IFCCategoryTemplate.ImportFromFile(Autodesk.Revit.DB.Document,System.String,System.String)
Import mapping template from a text file.
Remarks:
The imported template is saved in the document passed as parameter.
The active template of the document remains unchanged.
document:
A Revit document.
fileName:
A full text file name.
templateName:
A mapping template name.
Returns:
The mapping template element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The name already exists.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileAccessException:
Failed to access the text file.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to create IFCCategoryTemplate element.
Since:
2025

Autodesk.Revit.DB.IFCCategoryTemplate.ResetActiveTemplate(Autodesk.Revit.DB.Document)
Removes the information about active mapping temple of the document.
Remarks:
After calling this method, the active template of the document will be nullptr,
which means that in-session template should be used.
document:
The document to set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2025

Autodesk.Revit.DB.IFCCategoryTemplate.GetActiveTemplate(Autodesk.Revit.DB.Document)
Gets the active mapping template element in the document.
Remarks:
New documents have no active mapping template and it implies in-session template usage.
document:
The document to find the active mapping template.
Returns:
The active mapping template, or nullptr if none.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.IFCCategoryTemplate.GetOrCreateInSessionTemplate(Autodesk.Revit.DB.Document)
Gets the in-session non-serializable template or create new.
document:
The document to find the in-session mapping template.
Returns:
The mapping template, or nullptr if failed to create.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.IFCCategoryTemplate.Create(Autodesk.Revit.DB.Document,System.String)
Create a IFC category mapping template with default values.
document:
Document where created mapping template is saved.
name:
The name specified to this mapping template.
Returns:
The new mapping template instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The name already exists.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.IFCCategoryTemplate.IsValidCategoryMappingFile
Whether or not the category mapping file is valid.
Since:
2026